from importall import *

class MyConfig(QConfig):
    """ Config of application """
    X坐标基础值 = ConfigItem("坐标换算组", "X坐标基础值", 0)
    Y坐标基础值 = ConfigItem("坐标换算组", "Y坐标基础值", 0)
    X坐标偏移倍率 = ConfigItem("坐标换算组", "X坐标偏移倍率", 1)
    Y坐标偏移倍率 = ConfigItem("坐标换算组", "Y坐标偏移倍率", 1)
    直角坐标基础宽度 = ConfigItem("坐标换算组", "直角坐标基础宽度", 1440)
    直角坐标基础高度 = ConfigItem("坐标换算组", "直角坐标基础高度", 500)
    圆心基础X坐标 = ConfigItem("坐标换算组", "圆心基础X坐标", 400)
    圆心基础Y坐标 = ConfigItem("坐标换算组", "圆心基础Y坐标", 400)
    圆心偏移X坐标 = ConfigItem("坐标换算组", "圆心偏移X坐标", 0)
    圆心偏移Y坐标 = ConfigItem("坐标换算组", "圆心偏移Y坐标", 0)
    半径偏移倍率 = ConfigItem("坐标换算组", "半径偏移倍率", 1)# 原再怎么画也不会变扁，总比方形图少一个参数
    极坐标基础半径 = ConfigItem("坐标换算组", "极坐标基础半径", 400)

    边缘提取的核大小 = RangeConfigItem("函数参数缓存组", "边缘提取的核大小", 3, RangeValidator(0, 10))
    边缘提取的阈值 = RangeConfigItem("函数参数缓存组", "边缘提取的阈值", 50, RangeValidator(0, 100))
    边缘提取的形态学核大小 = RangeConfigItem("函数参数缓存组", "边缘提取的形态学核大小", 3, RangeValidator(0, 10))
    边缘提取的描线宽度 = RangeConfigItem("函数参数缓存组", "边缘提取的描线宽度", 1, RangeValidator(0, 20))
    边缘提取的扩展像素 = RangeConfigItem("函数参数缓存组", "边缘提取的扩展像素", 0, RangeValidator(0, 20))




    文件夹路径 = ConfigItem("数据清理窗口组", "文件夹路径", "")
    正在使用的文件索引 = ConfigItem("数据清理窗口组", "正在使用的文件索引", 1)
    正在使用的文件名字 = ConfigItem("数据清理窗口组", "正在使用的文件名字", "")
    当前使用的文件路径 = ConfigItem("数据清理窗口组", "当前使用的文件路径", "")
    正在使用的页数 = ConfigItem("数据清理窗口组", "正在使用的页数", 1)
    是否需要完整报错信息 = ConfigItem("数据清理窗口组", "是否需要完整报错信息", False)
    是否需要规整数据 = ConfigItem("数据清理窗口组", "是否需要规整数据", False)
    是否默认预处理 = ConfigItem("数据清理窗口组", "是否默认预处理", False, BoolValidator())
    文件保存路径 = ConfigItem("数据清理窗口组", "文件保存路径", "")
    预处理代码 = ConfigItem("数据清理窗口组", "预处理代码", "")
    上一个处理的文件路径 = ConfigItem("数据清理窗口组", "上一个处理的文件路径", "")
    是否加载参考图 = ConfigItem("数据清理窗口组", "是否加载参考图", True)
    是否自动显示遮罩 = ConfigItem("数据清理窗口组", "是否自动显示遮罩", False)
    是否每绘制一步都刷新遮罩 = ConfigItem("数据清理窗口组", "是否每绘制一步都刷新遮罩", False)
    批量输出图片时根据图片类型分类 = ConfigItem("数据清理窗口组", "批量输出图片时根据图片类型分类", False)
    批量预处理后是否保存当前文件 = ConfigItem("数据清理窗口组", "批量预处理后是否保存当前文件", True)
    是否要渲染没有蒙版的文件 = ConfigItem("数据清理窗口组", "是否要渲染没有蒙版的文件", False)
    上一个文件的文件路径 = ConfigItem("数据清理窗口组", "上一个文件的文件路径", [])
    预处理函数只显示输出信息 = ConfigItem("数据清理窗口组", "预处理函数只显示输出信息", False)
    预处理函数代码print替换 = ConfigItem("数据清理窗口组", "预处理函数代码print替换", False)
    绘制图像dpi = RangeConfigItem("函数参数缓存组", "绘制图像dpi", 100, RangeValidator(0, 2000))
    是否输出渲染图片同时保存当前修改 = ConfigItem("数据清理窗口组", "是否输出渲染图片同时保存当前修改", False)
    是否输出渲染图片时输出对应的修改后npz文件 = ConfigItem("数据清理窗口组", "是否输出渲染图片时输出对应的修改后npz文件", False)
    是否渲染导出时输出的npz文件按照图片类型分类 = ConfigItem("数据清理窗口组", "是否渲染导出时输出的npz文件按照图片类型分类", False)
    缓存遮罩保存位置 = ConfigItem("数据清理窗口组", "缓存遮罩保存位置", "")
    是否只绘制一张参考图 = ConfigItem("数据清理窗口组", "是否只绘制一张参考图", False)
    有背景图时是否直接加载背景图 = ConfigItem("数据清理窗口组", "有背景图时是否直接加载背景图", True)
    是否开启夜间模式 = ConfigItem("数据清理窗口组", "是否开启夜间模式", False)
    软件主题色 = ColorConfigItem("数据清理窗口组", "软件主题色", "#009faa")
    软件图标 = OptionsConfigItem("数据清理窗口组", "软件图标","太阳", OptionsValidator(["太阳", "雪天", "雷雨", "月亮"]), restart=True)
    自动显示遮罩延迟时间 = RangeConfigItem("数据清理窗口组", "自动显示遮罩延迟时间", 1500, RangeValidator(0, 15000))
    


    自定义绘图函数 = ConfigItem("自定义组", "自定义绘图函数", "")
    自定义绘图函数能不能用 = ConfigItem("自定义组", "自定义绘图函数能不能用", False)


    用于判定是否使用极坐标绘图的的键 = ConfigItem("绘图数据组", "用于判定是否使用极坐标绘图的的键", "LDR")
    用于绘制绘图区背景图的键 = ConfigItem("绘图数据组", "用于绘制绘图区背景图的键", "Z1")
    是否用拥有该键作为判断极坐标绘图的依据 = ConfigItem("绘图数据组", "是否用拥有该键作为判断极坐标绘图的依据", False)
    显示参考图的行数 = RangeConfigItem("绘图数据组", "显示参考图的行数", 1, RangeValidator(0, 30))

    绘图区缺失值是否设置为白色 = ConfigItem("绘图数据组", "绘图区缺失值是否设置为白色", False)
    绘图区灰度图像是否颜色反转 = ConfigItem("绘图数据组", "绘图区灰度图像是否颜色反转", False)
    绘图区图像是否转置 = ConfigItem("绘图数据组", "绘图区图像是否转置", False)
    绘图区图像是否上下翻转 = ConfigItem("绘图数据组", "绘图区图像是否上下翻转", False)
    绘图区图像是否左右翻转 = ConfigItem("绘图数据组", "绘图区图像是否左右翻转", False)
    绘图区图像极坐标是否是逆时针 = ConfigItem("绘图数据组", "绘图区图线极坐标是否是逆时针", True)
    绘图区图像极坐标翻转角度 = RangeConfigItem("绘图数据组", "绘图区图像极坐标翻转角度", 0, RangeValidator(-360, 360))
    传递的遮罩是否转置 = ConfigItem("绘图数据组", "传递的遮罩是否转置", False)
    传递的遮罩是否上下翻转 = ConfigItem("绘图数据组", "传递的遮罩是否上下翻转", False)
    传递的遮罩是否左右翻转 = ConfigItem("绘图数据组", "传递的遮罩是否左右翻转", False)
    传递的遮罩极坐标是否是逆时针 = ConfigItem("绘图数据组", "传递的遮罩极坐标是否是逆时针", True)
    传递的遮罩极坐标翻转角度 = RangeConfigItem("绘图数据组", "传递的遮罩极坐标翻转角度", 0, RangeValidator(-360, 360))

    图像类型对应的源文件的key = ConfigItem("绘图数据组", "图像类型对应的源文件的key", {
                                                                                    "雷达反射率": "Z1",
                                                                                    "多普勒速度": "V1",
                                                                                    "速度谱宽": "W1",
                                                                                    "雷达信噪比": "SNR1",
                                                                                    "线性退偏振比": "LDR"
                                                                                })
    
    图像类型对应的不同对象的选择数值 = ConfigItem("绘图数据组", "图像类型对应的不同对象的选择数值", {"nan值":"0",
                                                                                            "待判断值":"1",
                                                                                            "判断为云":"2",
                                                                                            "地物杂波":"3",  # 新增
                                                                                            "非地物杂波":"4",  # 新增
                                                                                            "判断为气象目标物但不是云":"5",  # 原来是4，现在顺延为5
                                                                                            "不确定":"6",})  # 原来是5，现在顺延为6
    图像类型对应的不同对象的选择颜色 = ConfigItem("绘图数据组", "图像类型对应的不同对象的选择颜色", {"nan值":"#000000",# 黑色
                                                                                        "待判断值":"#FFFFFF",# 白色
                                                                                        "判断为云":"#FF0000",# 红色
                                                                                        "地物杂波":"#FF00FF",  # 正洋红色
                                                                                        "非地物杂波":"#00FF00",  # 绿色
                                                                                        "判断为气象目标物但不是云":"#0000FF",# 蓝色
                                                                                        "不确定":"#FFFF00",})# 黄色
    图像类型对应自定义色标 = ConfigItem("绘图数据组", "图像类型对应自定义色标（可以十六进制也可以rgb）", {})