from importall import *
from LittleCards.Documentation import Documentation
# 浮出的说明文字框
class CustomFlyoutView(FlyoutViewBase):
    """
    浮出帮助的自定义视图
    """
    def __init__(self, parent=None):
        super().__init__(parent)
        self.vBoxLayout = QVBoxLayout(self)
        self.TextEdit = TextEdit()
        # 检查当前目录下是否存在readme.md文件
        if os.path.exists('README.md'):
            # 如果存在，读取并使用readme.md的内容
            with open('README.md', 'r', encoding='utf-8') as file:
                软件说明 = file.read()
        else:
            软件说明 = Documentation
        self.TextEdit.setMarkdown(软件说明)
        self.TextEdit.setFixedSize(900, 600)
        颜文字 = ["(⁎⁍̴̛ᴗ⁍̴̛⁎)", "╰(✿´⌣`✿)╯♡", "(๑•́ ₃ •̀๑)ｴｰ", "(๑ơ ₃ ơ)♥", "(๑¯ω¯๑)", "(ง •̀_•́)ง‼", "٩(๑`^´๑)۶", "٩(๑òωó๑)۶", "(⌒ω⌒)", "( ◠‿◠ )", "٩(๑˃̵ᴗ˂̵๑)۶", "ʕ•̀ω•́ʔ✧", "(•ө•)♡", "( つ•̀ω•́)つ", "( ๑॔˃̶◡ ˂̶๑॓)◞♡", "( ó × ò)", "( ๑͒･(ｴ)･๑͒)", "꒰ ๑͒ ･౪･๑͒꒱", "꒰ ๑͒ óｪò๑͒꒱", "σ(o’ω’o)", "(๑•́ ₃ •̀๑)/", "(･’ω’･)", "(｡◕ ∀ ◕｡)", "╲(｡◕‿◕｡)╱", "(´｡✪ω✪｡｀)", "(✿╹◡╹)", "(* Ŏ∀Ŏ)", "(๑◔‿◔๑)", "(<em>δωδ</em>)」", "(･◡ु‹ )", "٩(๑òωó๑)۶", "(灬╹ω╹灬)", "•ू(ᵒ̴̶̷ωᵒ̴̶̷*•ू)", "( ๑˃̶ ॣꇴ ॣ˂̶)♪⁺", "(๑˃̵ᴗ˂̵)و ﾖｼ!", "(<em>´◒`</em>)", "(๑･㉨･๑)", "(｡╹ω╹｡)", "(<em>｀益´</em>)がう", "٩( ╹▿╹ )۶", "(◍´ಲ`◍)", "(●´ϖ`●)", "(◍<em>3</em>◍)", "(●♡ᴗ♡●)", "(◍╹ｘ╹◍)", "(●☌◡☌●)", "(●･̆⍛･̆●)", "(◕̻͠◸◕̻͠)", "ฅ ̳͒•ˑ̫• ̳͒ฅ♡", "චᆽච", "༶ඬ༝ඬ༶", "ოර⌄රო", "⁙ὸ‿ό⁙", "(,,◕ ⋏ ◕,,)", "(..＞◡＜..)", "(,,Ծ‸Ծ,, )", "(❍ᴥ❍ʋ)", "( ͡° ᴥ ͡° ʋ)", "V●ω●V", "V✪ω✪V", "V✪⋏✪V", "∪ ̿–⋏ ̿–∪", "∪･ω･∪", "໒( ●ܫฺ ●)ʋ", "໒( = ᴥ =)ʋ", "໒( ̿･ ᴥ ̿･ )ʋ", "໒( ̿❍ ᴥ ̿❍)ʋ", "▽･ｪ･▽ﾉ”", "ଘ(∪・ﻌ・∪)ଓ", "∪◕ฺᴥ◕ฺ∪", "໒(＾ᴥ＾)७", "ฅU=ﻌ =Uฅ", "ᐡ ・ ﻌ ・ ᐡ", "ᐡ ᐧ ﻌ ᐧ ᐡ", "(*´_ゝ｀)", "(<em>´∀`</em>)", "(<em>´ｪ｀</em>)", "｡(<em>^▽^</em>)ゞ", "(‘-’*)", "(<em>´∀`</em>)", "(<em>^^</em>)", "(*ﾟｰﾟ)ゞ", "(ノ<em>゜▽゜</em>)", "ฅ(<em>°ω°</em>ฅ)", "(<em>ﾟ∀ﾟ</em>)", "(<em>´ω｀</em>)", "(´ω｀*)", "(⁎❝᷀ົ ˙̫ ❝᷀ົ⁎)", "ε=ε=ε=ε=ε” “(/<em>’-‘</em>)/", "ヽ(＊&gt;∇&lt;)ﾉ", "(<em>´-｀</em>)", "( <em>’ω’</em> )", "( <em>∵</em> )", "<em>:ﾟ</em>｡⋆ฺ(*´◡`)", "(#^.^#)", "(#｀ε´# )ゞ", "(＃⌒∇⌒＃)ゞ", "꒰⌗´͈ ᵕ ॣ`͈⌗꒱৩", "(#ﾟﾛﾟ#)", "꒰#’ω`#꒱੭", "(#^^#)ゞ", "(๑•́ ω •̀๑)", "⁝(๑⑈௰⑈)◞⁝˚º꒰꒱", "(๑•́ ₃ •̀๑)", "(๑ˊ▵ॢˋ̥๑)", "(๑´ㅂ`๑)", "(๑ゝω╹๑)", "(´๑•_•๑)", "(๑•́ω•̀๑)", "(๑⃙⃘·́ω·̀๑⃙⃘)੨", "(◞ ๑⑈௰⑈)", "(๑´ω`๑)", "(๑癶ω癶๑)", "(´•ω•`๑)", "(๑´•ω • `๑)", "(_๑˘ㅂ˘๑)", "(๑´⍢`๑)", "(๑′°︿°๑)", "(๑́•∀•๑̀)ฅ", "(๑ּగ⌄ּగ๑)", "(⁶ੌ௰⁶ੌ๑)", "(๑꒪̇⌄꒪̇๑)", "(๑꒪⍘꒪๑)", "(๑⁍᷄౪⁍᷅๑)", "Σ(๑꒪⃙⃚᷄ꑣ꒪⃚⃙᷅๑۶)۶", "(๑￫‿￩๑)", "(๑•́‧̫•̀๑)", "(๑･▱･๑)", "(͡o‿O͡)", "( ͡°³ ͡°)", "( ͡°⊖ ͡°)", "( ͡°Ɛ ͡°)", "( ͡°з ͡°)", "( ͡°- ͡°)", "( ͡°⊱ ͡°)", "( ͡°❥ ͡°)", "( ͡°ω ͡°)", "(ง⌐□ل͜□)ง", "( ͡°〓 ͡°)", "( ͡°👅 ͡°)", "(͡• ͜ʖ ͡•)", "( ͡° ͜ ͡°)", "( ͡° ᴥ ͡°)", "(͡• ͜໒ ͡• )", "( ͡◉ ͜ʖ ͡◉)", "( ͡° ͜V ͡°)", "( ͡• ͜ʖ ͡• )", "ヽ(͡◕ ͜ʖ ͡◕)ﾉ", "(◕ᴗ◕✿)", "(◕◡◕✿)", "(◔◡◔✿)", "(｡◕‿◕｡✿)", "(◡‿◡✿)", "(◠‿◠✿)", "(◕ܫ◕✿)", "(◕▿◕✿)", "(◕ ワ ◕✿)"]
        # 从列表中随机选择一个颜文字
        选中的颜文字 = random.choice(颜文字)
        self.button = PrimaryPushButton(选中的颜文字)
        def change_button_text():
            # 从颜文字列表中随机选择一个并设置为按钮的文字
            self.button.setText(random.choice(颜文字))
        self.button.clicked.connect(change_button_text)

        self.button.setFixedWidth(140)
        self.vBoxLayout.setSpacing(12)
        self.vBoxLayout.setContentsMargins(20, 16, 20, 16)
        self.vBoxLayout.addWidget(self.TextEdit)

        # 创建水平布局用于按钮
        hBoxLayout = QHBoxLayout()
        hBoxLayout.addItem(QSpacerItem(40, 20, QSizePolicy.Expanding, QSizePolicy.Minimum))
        hBoxLayout.addWidget(self.button)
        hBoxLayout.addItem(QSpacerItem(40, 20, QSizePolicy.Expanding, QSizePolicy.Minimum))

        # 将水平布局添加到垂直布局中
        self.vBoxLayout.addLayout(hBoxLayout)